DEAD_MESSAGE = 'Сайт Самарского университета гордо умер.'

GREETING_MESSAGE = '❣️Привет❣️ Я бот для просмотра расписания Самарского Университета!\n\n' \
                   '‼️Для работы необходима регистрация‼️\n\n' \
                   'Используйте команду /register для прохождения регистрации\n\n' \
                   'Используйте команду /help для получения инструкций по управлению ботом\n'

HELP_MESSAGE = '🛠 <b>Краткая документация для доступных команд бота</b> 🛠\n\n' \
               '<i>Сегодня</i>  -  Расписание на сегодня\n\n' \
               '<i>Завтра</i>  -  Расписание на завтра\n\n' \
               '<i>Послезавтра</i>  -  Расписание на послезавтра\n\n' \
               '<i>Текущая неделя</i>  -  Расписание на текущую неделю\n\n' \
               '<i>Следующая неделя</i>  -  Расписание на следующую неделю\n\n' \
               '<i>Пикрандом</i>  -  Рандомная пикча из директории бота\n\n' \
               '<i>/picture</i>  -  Альтернатива пикрандому\n\n' \
               '❗Все команды можно использовать в любом регистре❗\n\n'\
               '☘ Новые картиночки можете присылать админу бота : @tssvettnik ☘ \n\n'
HELP_ADMIN_MESSAGE = '🛠 <b>Краткая документация для команд админа бота</b> 🛠\n\n' \
                     '<i>/amount</i>  -  Текущее количество пользователей в бд\n\n'

START_REGISTER_MESSAGE = 'Приступим к регистрации!\n\n' \
                         'Введите название факультета в корректном формате:\n' \
                         '‼ Пример корректного значения: Институт информатики и кибернетики ‼'
INCORRECT_FACULTY_MESSAGE = 'Некорректный ввод факультета.\n' \
                            'Введите свой факультет:\n' \
                            '‼ Пример значения: Институт информатики и кибернетики ‼'

CORRECT_FACULTY_MESSAGE = '⭐️Факультет выбран успешно⭐️\n' \
                          'Введите свой курс:\n' \
                          '‼ Корректное значение: число от 1 до 5 ‼'

INCORRECT_COURSE_MESSAGE = 'Некорректный ввод курса.\n' \
                           'Введите свой курс:\n' \
                           '‼ Корректное значение: число от 1 до 5 ‼'

CORRECT_COURSE_MESSAGE = '⭐️ Курс выбран успешно ⭐️\n' \
                         'Введите свою группу:\n' \
                         '‼ Пример значения: 6101-010302D ‼'

INCORRECT_GROUP_MESSAGE = 'Некорректный ввод группы.\n' \
                          'Введите свою группу:\n' \
                          '‼ Пример значения: 6101-010302D ‼'

CORRECT_GROUP_MESSAGE = '⭐️ Группа выбрана успешно ⭐️'

SUCCESS_REGISTER_MESSAGE = '⭐️ Регистрация завершена ⭐️\n\n' \
                           'Можете без проблем пользоваться ботом!\n\n' \
                           'Напоминаю, используйте команду /help для получения инструкций по управлению ботом.'

ALREADY_REGISTERED_MESSAGE = '🌟 Вы уже зарегистрированы 🌟\n\n' \
                             'Хотите поменять данные? Используйте /repeat\n\n'

REPEAT_REGISTER_MESSAGE = 'Приступим к перерегистрации!\n\n' \
                          'Введите название факультета в корректном формате:\n' \
                          '‼ Пример значения: Институт информатики и кибернетики ‼'

NOT_ADMIN_MESSAGE = 'Тебе сюда нельзя....'

ADMIN_MESSAGE = 'Приветствую, разработчик!'

PICTURE_MESSAGE = '/picture'

NEED_TO_REGISTER_MESSAGE = '‼ Для работы бота нужно зарегистрироваться ‼\n\n' \
                           '‼ Используйте команду /register для регистрации ‼'

NEW_PICTURE_MESSAGE = "☘ Новая картинка загружена ☘\n\n" \
                      "Работаем работаем....."

ALREADY_EXIST_PICTURE_MESSAGE = "‼ Картинка уже существует ‼"