DEAD_MESSAGE = 'Сайт Самарского университета гордо умер.'

GREETING_MESSAGE = '❣️Привет❣️ Я бот для просмотра расписания Самарского Универститета!\n\n' \
                   '‼️Для начала работы необходимо пройти регистрацию.‼️\n\n' \
                   'Используйте команду /register для прохождения регистрации.\n\n' \
                   'Используйте команду /help для получения инструкций по управлению ботом.\n'

HELP_MESSAGE = '🛠 <b>Краткая документация для доступных команд бота</b> 🛠\n\n' \
               '<i>Сегодня</i>  -  Расписание на сегодня\n\n' \
               '<i>Завтра</i>  -  Расписание на завтра\n\n' \
               '<i>Послезавтра</i>  -  Расписание на послезавтра\n\n' \
               '<i>Текущая неделя</i>  -  Расписание на текущую неделю\n\n' \
               '<i>Следующая неделя</i>  -  Расписание на следующую неделю\n\n' \
               '<i>Пикрандом</i>  -  Рандомная пикча из директории бота\n\n' \
               '❗Все команды можно использовать в любом регистре❗\n'

START_REGISTER_MESSAGE = 'Приступим к регистрации!\n\n' \
                         'Введите название факультета в корректном формате:'

INCORRECT_FACULTY_MESSAGE = 'Некорректный ввод факультета.\n' \
                            'Введите свой факультет в корректном формате:'

CORRECT_FACULTY_MESSAGE = 'Факультет выбран успешно!\n' \
                          'Теперь введите свой курс(число от 1 до 5):'

INCORRECT_COURSE_MESSAGE = 'Некорректный ввод курса.\n' \
                           'Введите свой курс в корректном формате(число от 1 до 5):'

CORRECT_COURSE_MESSAGE = 'Курс выбран успешно!\n' \
                         'Теперь введите свою группу:'

INCORRECT_GROUP_MESSAGE = 'Некорректный ввод группы.\n' \
                          'Введите свою группу в корректном формате:'

CORRECT_GROUP_MESSAGE = 'Группа выбрана успешно!'

SUCCESS_REGISTER_MESSAGE = 'Регистрация завершена!\n\n' \
                           'Можете без проблем пользоваться ботом!\n\n' \
                           'Напоминаю, используйте команду /help для получения инструкций по управлению ботом.'
